IDEA Open Model
OpenModel Methods
Compatible with IDEA StatiCa 20.1
The OpenModel type exposes the following members.
Methods
Name | Description
AddObject(OpenAttribute)
 Add new atribute object into collections
AddObject(OpenElementId)
 Add new object into collections
GetMaxId(String)
 Get max Id value for specified type
GetMaxId(Type)
 Get max Id value for specified type
GetMaxId(OpenElementId)
 Get max Id value for specified type
GetObject
 Gets the Open element object from the Reference element
LoadFromStream
 Creates the instance of Open Model from the stream
LoadFromString
 Creates the instance of Open Model from xml string
LoadFromXmlFile
 Creates the instance of Open Model from the XML file
ReferenceElementsReconstruction
 Should be called after deserialization of the open model from xml
SaveToXmlFile
 Saves content into file as a XML format
Top
See Also
Reference
OpenModel Class
IdeaRS.OpenModel Namespace